xmlsamples/DAS_Query/PROD-KR-GetDeliveryServices-AIS-KRQ70.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:h2h-das-request>
         <channel>
            <type>H2H</type>
            <name>KTB Bank</name>
            <version>9500</version>
         </channel>
         <foreign_remote_system>
            <identifier>WGBSKRQ700P</identifier>
            <reference_no>29997000141024240</reference_no>
            <counter_id>YX240862</counter_id>
         </foreign_remote_system>
         <name>GetDeliveryServices</name>
         <filters>
            <queryfilter1>en</queryfilter1>
            <queryfilter2>KR USD</queryfilter2>
            <queryfilter3>PH PHP</queryfilter3>
            <queryfilter4>ALL</queryfilter4>
         </filters>
      </xrsi:h2h-das-request>
   </soapenv:Body>
</soapenv:Envelope>